# THIS FILE IS AUTOMATICALLY GENERATED
# Project: F:\Google\Cypress\WaterMeasurement\EmulRelay\psoc\Converter_PC_RS_485\Converter_PC_RS_485.cydsn\Converter_PC_RS_485.cyprj
# Date: Wed, 29 Nov 2017 21:32:47 GMT
#set_units -time ns
create_clock -name {UART_PC_SCBCLK(FFB)} -period 729.16666666666663 -waveform {0 364.583333333333} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {UART_RS_485_SCBCLK(FFB)} -period 1437.5 -waveform {0 718.75} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {Clock_1(FFB)} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {UART_PC_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 35 71} [list]
create_generated_clock -name {UART_RS_485_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 69 139} [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 48001 96001} [list]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/hfclk}] -edges {1 48001 96001} [list [get_pins {ClockBlock/udb_div_0}]]


# Component constraints for F:\Google\Cypress\WaterMeasurement\EmulRelay\psoc\Converter_PC_RS_485\Converter_PC_RS_485.cydsn\TopDesign\TopDesign.cysch
# Project: F:\Google\Cypress\WaterMeasurement\EmulRelay\psoc\Converter_PC_RS_485\Converter_PC_RS_485.cydsn\Converter_PC_RS_485.cyprj
# Date: Wed, 29 Nov 2017 21:32:45 GMT
